/* -------------------------------------------------------------------------
//	文件名		：	4 test_data.h
//	创建者		：	林哲
//	创建时间	：	2008-8-21 12:01:04
//	功能描述	：	用于检测4代码规范的例程
//
//	$Id: $
// -----------------------------------------------------------------------*/
#ifndef __8_1 TEST_CHANGE_H__
#define __8_1 TEST_CHANGE_H__

// -------------------------------------------------------------------------

#include <iostream>
using namespace std;
///测试数据使用了我们最常用代码,然后将其中适当的修改



if (0 == -2)	n++;
// 1）测试数据1 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：错误



if (0 == -2)
	n++;
else if (0 == 1)
	n++;
else n++;
// 1）测试数据2 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果： 错误



for (int i = 0; i < 9; i++) i++;
// 1）测试数据3 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：错误



while (1) i++;
// 1）测试数据4
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：错误

if (0 == -2)
	n++;
else n--;
// 1）测试数据5 
// 2）说明 :循环，分支代码和执行代码不能在同一行上.
// 3）预期结果：错误

if (0 == -2)
{
	if (1 == -2) n++;
	for (int i = 1; i< 10; i++)
		a++;
}
// 1）测试数据5 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：错误

for (int i = 0; i < 9; i++);
// 1）测试数据6 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：正确

while (i++ < 10);
// 1）测试数据7 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：正确

while (1)
{
	if (a == b)
	{
		for (int i = 1; i < 50; i++)
		{
			if (i == a)
				a++;
		}
	}
}
// 1）测试数据8 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：正确

while (1)
{
	if (a == b)
	{
		for (int i = 1; i < 50; i++)
		{
			if (i == a) a++;
		}
	}
}
// 1）测试数据9  
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：错误


if (0 == -2)	//注释
	n++;
// 1）测试数据10 
// 2）说明 :循环，分支代码和执行代码不能在同一行上
// 3）预期结果：正确


// -------------------------------------------------------------------------
// $Log: $

#endif /* __8_1 TEST_CHANGE_H__ */
